PANDAS EXERCISE (REVISION)

In [2]:
import pandas as pd

EXERCISE 1 - List-to-Series Conversion

In [9]:
given = [2,4,5,6,9]

series = pd.Series(given)
print(series)

0    2
1    4
2    5
3    6
4    9
dtype: int64

EXERCISE 2 - List-to-Series Conversion with Custom Indexing

In [11]:
given = [2,4,5,6,9]

series = pd.Series(given, index=[1,3,4,7,8])
series

1    2
3    4
4    5
7    6
8    9
dtype: int64

EXERCISE 3 - Date Series Generation

In [16]:
data_series = pd.date_range(start='01-11-2022',end='15-11-2022')
data_series

DatetimeIndex(['2022-01-11', '2022-01-12', '2022-01-13', '2022-01-14',
               '2022-01-15', '2022-01-16', '2022-01-17', '2022-01-18',
               '2022-01-19', '2022-01-20',
               ...
               '2022-11-06', '2022-11-07', '2022-11-08', '2022-11-09',
               '2022-11-10', '2022-11-11', '2022-11-12', '2022-11-13',
               '2022-11-14', '2022-11-15'],
              dtype='datetime64[ns]', length=309, freq='D')

EXERCISE 4 - Implementing a function on each and every element of a series

In [17]:
series = pd.Series([2,4,6,8,10])
print(series)

modified_series = series.apply(lambda x:x/2)
modified_series

0     2
1     4
2     6
3     8
4    10
dtype: int64

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

EXERCISE 5 - Dictionary-to-Dataframe Conversion

In [18]:
dict_ = {'name':['Vinay', 'Kushal', 'Aman','Rahul','Ramesh'],
        'age':[22, 25, 24,28,27],
        'occ':['engineer', 'doctor', 'accountant','doctor','doctor'],
        'salary':[60000,70000,50000,60000,65000]}

df = pd.DataFrame(dict_)
df

     name  age         occ  salary
0   Vinay   22    engineer   60000
1  Kushal   25      doctor   70000
2    Aman   24  accountant   50000
3   Rahul   28      doctor   60000
4  Ramesh   27      doctor   65000

EXERCISE 6 - 2D List-to-Dataframe Conversion

In [19]:
list_ = [[2,'Vishal',22],
         [1,'Kushal',25],[1,'Aman',24]]

dfx = pd.DataFrame(list_, columns=['id','name','age'])
dfx

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 7 - Reading CSV to Dataframe

In [21]:
dfc = pd.read_csv('new_qrcode2.csv')
dfc.tail()

        qrcode                  barcode
145452  ABRNFC  https://kop0.com/ABRNFC
145453  ABRNFD  https://kop0.com/ABRNFD
145454  ABRNFE  https://kop0.com/ABRNFE
145455  ABRNFF  https://kop0.com/ABRNFF
145456  ABRNFG  https://kop0.com/ABRNFG

EXERCISE 8 - Setting Custom Index in Dataframe

In [27]:
print(dfx.head())

print()

df_customindex = dfx.set_index('id')
df_customindex

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

EXERCISE 9 - Sorting a Dataframe by Index

In [29]:
print(df_customindex)
print()
df_sorted_customindex = df_customindex.sort_index()
df_sorted_customindex

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

      name  age
id
1   Kushal   25
1     Aman   24
2   Vishal   22

EXERCISE 10 - Sorting a Dataframe by Multiple Columns

In [31]:
print(dfx) #original DF

print()

df_sort_multi_values = dfx.sort_values(by=['name','age'])
df_sort_multi_values

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
2   1    Aman   24
1   1  Kushal   25
0   2  Vishal   22

EXERCISE 11 - DataFrame with Custom Index to DataFrame with Dataframe with default indexes

In [33]:
print(df_customindex)
print()
df = df_customindex.reset_index()
df

      name  age
id
2   Vishal   22
1   Kushal   25
1     Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

EXERCISE 12 - Indexing and Selecting Columns in a DataFrame

In [38]:
print(df) # OG DF
print()

o = df['name']
o

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object

Use iloc

In [39]:
print(df)
print()

name = df.iloc[:,1]
name

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

0    Vishal
1    Kushal
2      Aman
Name: name, dtype: object